---
kind: other
id: Events.T:Autodesk.Revit.UI.AddInCommandBinding
source: html/e8af253a-52cf-2c62-9572-d58fdcf699b3.htm
---
# AddInCommandBinding Events

Occurs before the command associated with this AddInCommandBinding executes.